Aggregate Function

In [ ]:
'''
Aggregate Function takes a set of values and returns a single result
 mean -> average
 sum -> adds up all values
 min -> smallest one
 count -> count total number of record

 unique -> Shows all unique records
 nunique -> shows unique records count

 values_count ->  shows records and their counts

'''

'''
Data -> 
  Categorica -> Nominal Ordinal
  Numerical -> Discrete Continous
'''

In [1]:
import pandas as pd

In [5]:
df = pd.read_csv('Employees.csv')
df.head(10)

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,100,Steven,King,SKING,515.123.4567,17.06.2003,AD_PRES,24000,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,21.09.2005,AD_VP,17000,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,13.01.2001,AD_VP,17000,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,03.01.2006,IT_PROG,9000,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,21.05.2007,IT_PROG,6000,NaN,103.0,60.0
5,105,David,Austin,DAUSTIN,590.423.4569,25.06.2005,IT_PROG,4800,NaN,103.0,60.0
6,106,Valli,Pataballa,VPATABAL,590.423.4560,05.02.2006,IT_PROG,4800,NaN,103.0,60.0
7,107,Diana,Lorentz,DLORENTZ,590.423.5567,07.02.2007,IT_PROG,4200,NaN,103.0,60.0
8,108,Nancy,Greenberg,NGREENBE,515.124.4569,17.08.2002,FI_MGR,12008,NaN,101.0,100.0
9,109,Daniel,Faviet,DFAVIET,515.124.4169,16.08.2002,FI_ACCOUNT,9000,NaN,108.0,100.0

In [11]:
#Find average salary of employees
avg_salary = df['SALARY'].mean()
print(f'Average Salary : Rs {avg_salary:.2f}')

Average Salary : Rs 6560.58

In [12]:
#Find total salary of employees
total_salary = df['SALARY'].sum()
print(f'Total Salary : Rs {total_salary}')

Total Salary : Rs 728224

In [16]:
#Find max salary of employees
max_salary = df['SALARY'].max()
min_salary = df['SALARY'].min()

print(f'Min Salary : Rs {min_salary}')
print(f'Max Salary : Rs {max_salary}')

count_emp = df['EMPLOYEE_ID'].count()
print(f'Employee Count : {count_emp}')

Min Salary : Rs 2100
Max Salary : Rs 24000
Employee Count : 111

In [25]:
uniq_salary = df['SALARY'].unique()
print(f'Unique salary : {uniq_salary}')


uniq_sal_count = df['SALARY'].nunique()
print('')
print(f'uniq_sal_num : {uniq_sal_count}')

uniq_sal_values = df['SALARY'].value_counts()
print('')
print(uniq_sal_values)

Unique salary : [24000 17000  9000  6000  4800  4200 12008  8200  7700  7800  6900 11000
  3100  2900  2800  2600  2500  8000  7900  6500  5800  3200  2700  2400
  2200  3300  2100  3600  3500 14000 13500 12000 10500 10000  9500  7500
  7000  7200  6800  6400  6200 11500  9600  7400  7300  6100  8800  8600
  8400  4100  3400  3000  3800  4000  3900  4400 13000  8300]

uniq_sal_num : 58

SALARY
2500     6
10000    5
2600     4
2800     4
3100     4
3200     4
9000     4
2900     3
11000    3
8000     3
6500     3
7000     3
9500     3
12008    3
6000     2
2200     2
2400     2
8200     2
3300     2
2700     2
7500     2
6200     2
3600     2
4800     2
17000    2
4200     2
3000     2
8300     2
10500    2
5800     1
7700     1
24000    1
6900     1
7800     1
7900     1
12000    1
13500    1
14000    1
7200     1
6800     1
3500     1
2100     1
11500    1
6400     1
9600     1
7400     1
8800     1
8600     1
7300     1
6100     1
4100     1
8400     1
3800     1
3400     1
4000     1
3900     1
4400     1
13000    1
Name: count, dtype: int64

GROUPBY

In [ ]:
#Find salary total of employees by each department

Total_dep_sal = df.groupby('DEPARTMENT_ID')['SALARY'].sum().reset_index()
Total_dep_sal

    DEPARTMENT_ID  SALARY
0            10.0    4400
1            20.0   19000
2            30.0   24900
3            40.0   13000
4            50.0  156400
5            60.0   28800
6            70.0   20000
7            80.0  304500
8            90.0   58000
9           100.0   51608
10          110.0   40616